[
    { "term": "Slaps",
        "definition": "Really good or impressive (often used for music)."
    },
    {
        "term": "Aesthetic",
        "definition": "The overall look, vibe, or visual style of something or someone."
    },
    {
        "term": "Addy",
        "definition": "Abbreviation for \"address.\" (e.g., \"Send me the addy for the party.\")"
    },
    {
        "term": "Amped",
        "definition": "Extremely excited or energized."
    },
    {
        "term": "Ate",
        "definition": "To perform exceptionally well; to completely conquer something. (e.g., \"She ate that presentation, no crumbs left.\")"
    },
    {
        "term": "Aura",
        "definition": "The distinctive atmosphere or quality that seems to surround and be generated by a person, thing, or place. Often used in relation to someone's perceived energy."
    },
    {
        "term": "Bae",
        "definition": "Short for \"before anyone else\"; a term of endearment for a romantic partner or close friend."
    },
    {
        "term": "Bait",
        "definition": "Obvious, easily noticeable, or suspicious (often in a negative context, like \"that's bait\" meaning \"that's too obvious/risky\")."
    },
    {
        "term": "Bare",
        "definition": "Very, a lot, many, or plenty of. (e.g., \"I've got bare work to do,\" \"she's bare pretty.\")"
    },
    {
        "term": "Basic",
        "definition": "Someone or something unoriginal, mainstream, and predictable."
    },
    {
        "term": "Bed rotting",
        "definition": "Spending extended periods of time in bed, often on devices, avoiding responsibilities."
    },
    {
        "term": "Beef",
        "definition": "An argument or conflict."
    },
    {
        "term": "Beige Flag",
        "definition": "A personality trait or habit that is neither good nor bad, but just... there. (A humorous take on \"red flags\" and \"green flags\" in relationships.)"
    },
    {
        "term": "Bet",
        "definition": "An affirmation; meaning \"yes,\" \"okay,\" \"agreed,\" or \"for sure.\""
    },
    {
        "term": "BFR",
        "definition": "Acronym for \"Be For Real.\" Used to express disbelief or skepticism, or to demand seriousness."
    },
    {
        "term": "Big Yikes",
        "definition": "An exclamation of extreme embarrassment or dismay; something very awkward."
    },
    {
        "term": "Blinder",
        "definition": "An excellent performance or achievement (e.g., \"he pulled a blinder\")."
    },
    {
        "term": "Body Count",
        "definition": "The number of sexual partners someone has had."
    },
    {
        "term": "Bop",
        "definition": "A really good song; a catchy tune."
    },
    {
        "term": "Boo'd Up",
        "definition": "Being in a romantic relationship with someone."
    },
    {
        "term": "Bosh!",
        "definition": "An exclamation used when something is done quickly, suddenly, or successfully."
    },
    {
        "term": "Boujee",
        "definition": "Luxurious, high-class, or fancy, often with a hint of pretentiousness."
    },
    {
        "term": "Brainrot",
        "definition": "The idea that one's brain is \"rotting\" from consuming too much stimulating but often nonsensical online content."
    },
    {
        "term": "Brat (Summer/Energy)",
        "definition": "Coined by Charli XCX's 2024 album, refers to an aesthetic of genuine, self-possessed, non-conforming, rebellious, and effortlessly cool energy."
    },
    {
        "term": "Bruh",
        "definition": "A versatile exclamation expressing surprise, disbelief, frustration, or general camaraderie."
    },
    {
        "term": "Bruised",
        "definition": "Tired, drained, or exhausted (similar to \"knackered\")."
    },
    {
        "term": "Buff",
        "definition": "Attractive, muscular (often used for men). Can also mean \"good\" or \"impressive.\""
    },
    {
        "term": "Bussin'",
        "definition": "Extremely good or delicious, often used for food. (e.g., \"This pizza is bussin'!\")"
    },
    {
        "term": "Buzzing",
        "definition": "Very excited or happy."
    },
    {
        "term": "Cannon Event",
        "definition": "Refers to a pivotal or defining moment in someone's life, often humorous and implying it's unavoidable (from \"Spider-Man: Across the Spider-Verse\")."
    },
    {
        "term": "Cap",
        "definition": "A lie or falsehood."
    },
    {
        "term": "No Cap",
        "definition": "No lie; telling the truth, genuinely. (Strong ties to hip-hop culture, very popular in the US.)"
    },
    {
        "term": "Caught in 4K",
        "definition": "Caught definitively doing something wrong, with clear evidence, like a high-resolution photo or video."
    },
    {
        "term": "Cheugy",
        "definition": "Outdated, uncool, or trying too hard to be trendy, especially for millennials. (Was very popular in 2021-2022, still understood.)"
    },
    {
        "term": "Chill",
        "definition": "Relaxed, calm, or easygoing. Can also mean \"hang out.\""
    },
    {
        "term": "Chirps",
        "definition": "To flirt or chat up someone."
    },
    {
        "term": "Chuffed",
        "definition": "Very pleased or happy. (Still widely used, but often by younger generations too.)"
    },
    {
        "term": "Chronically Online",
        "definition": "Someone who spends an excessive amount of time on the internet and whose thoughts/behaviors are heavily influenced by online culture."
    },
    {
        "term": "Chunder",
        "definition": "To vomit. (Older slang, but still understood and used by some.)"
    },
    {
        "term": "Clapped",
        "definition": "Can mean very ugly or unattractive (often used harshly for people), or broken/worn out for objects."
    },
    {
        "term": "Clapback",
        "definition": "A swift, witty, and often sassy retort or comeback to an insult or criticism."
    },
    {
        "term": "Clout",
        "definition": "Influence, fame, or popularity, especially on social media."
    },
    {
        "term": "Coffee Badging",
        "definition": "The act of employees briefly showing up at their physical workplace, usually in the morning, to interact with coworkers before leaving (new WFH/hybrid work term)."
    },
    {
        "term": "Cooked",
        "definition": "Exhausted, done for, or in trouble."
    },
    {
        "term": "Cope",
        "definition": "Used dismissively to end an argument; similar to \"deal with it.\""
    },
    {
        "term": "Cozzie Livs",
        "definition": "Short for \"Cost of Living Crisis\" (a particularly British preoccupation right now)."
    },
    {
        "term": "Cracked",
        "definition": "Good, impressive, skilled (often used for a person's ability)."
    },
    {
        "term": "Crash Out",
        "definition": "To get mad or upset despite better judgment, often leading to reckless decisions. (Originates from African American communities.)"
    },
    {
        "term": "Creasing (or \"I'm creasing\")",
        "definition": "Laughing very hard."
    },
    {
        "term": "Cringe",
        "definition": "Content or behavior that is embarrassing, awkward, or uncomfortable to witness, often inducing second-hand embarrassment."
    },
    {
        "term": "Crossfaded",
        "definition": "Being both drunk and high at the same time."
    },
    {
        "term": "Curve",
        "definition": "To reject or ignore someone's romantic advances."
    },
    {
        "term": "Dank",
        "definition": "Excellent, high quality, or exceptionally cool (often for memes or cannabis)."
    },
    {
        "term": "Dayroom",
        "definition": "Something or someone that is basic, uninteresting, or boring (often for a person)."
    },
    {
        "term": "Dead/Dying/Ded",
        "definition": "Extremely amused or overwhelmed by something (like \"I'm dead from laughing\")."
    },
    {
        "term": "Deadass",
        "definition": "Being completely serious, truthful, or honest."
    },
    {
        "term": "Delulu",
        "definition": "Short for \"delusional\"; holding unrealistic or excessively idealistic beliefs, often humorously."
    },
    {
        "term": "Do it for the Plot",
        "definition": "Encouraging risky or spontaneous behavior for the sake of an interesting story or experience, often for social media."
    },
    {
        "term": "Doing bits",
        "definition": "Doing well, being successful, or achieving good things."
    },
    {
        "term": "Doomscrolling",
        "definition": "The act of consuming endless negative news or social media content, leading to feelings of anxiety and dread."
    },
    {
        "term": "Down bad",
        "definition": "Desperate for a relationship or attention."
    },
    {
        "term": "Dox",
        "definition": "To seek out and publish private information online about someone, usually with malicious intentions."
    },
    {
        "term": "Drag (someone)",
        "definition": "To mock or humiliate someone, often publicly."
    },
    {
        "term": "Drip",
        "definition": "A person's stylish, fashionable, or cool sense of clothing and overall appearance."
    },
    {
        "term": "E-boy/E-girl",
        "definition": "A style subculture, often associated with specific fashion, internet presence, and sometimes a more alternative or melancholic aesthetic."
    },
    {
        "term": "Eepy",
        "definition": "Sleepy (often used humorously)."
    },
    {
        "term": "ELI5",
        "definition": "Acronym for \"Explain Like I'm 5\" (meaning explain it simply)."
    },
    {
        "term": "Era",
        "definition": "A distinct period in one's life characterized by specific interests, activities, or priorities (e.g., \"I'm in my villain era\")."
    },
    {
        "term": "Extra",
        "definition": "Over-the-top, overly dramatic, or excessive in behavior or appearance."
    },
    {
        "term": "Face Card",
        "definition": "Referring to one's attractive face, often implying it's so good it \"never declines.\""
    },
    {
        "term": "Fam",
        "definition": "Short for \"family\"; refers to close friends or one's inner circle."
    },
    {
        "term": "Fax, No Printer",
        "definition": "An emphatic way of saying \"facts\" or \"that's undeniably true,\" implying no further explanation is needed."
    },
    {
        "term": "Feral",
        "definition": "Acting wildly, uncontrollably, or without inhibition (often humorously)."
    },
    {
        "term": "F.R. / For Real",
        "definition": "To emphasize agreement or sincerity."
    },
    {
        "term": "Finessing",
        "definition": "Skillfully manipulating a situation to one's advantage, often in a clever or subtle way."
    },
    {
        "term": "Finna",
        "definition": "Short for \"fixing to\"; going to, or about to. (Rooted in Southern American English)."
    },
    {
        "term": "Fire",
        "definition": "Something extremely good, cool, or impressive."
    },
    {
        "term": "Finsta",
        "definition": "A \"fake Instagram\" account, often used for more private or unfiltered content shared with a smaller group of close friends."
    },
    {
        "term": "Fit/Fit Check",
        "definition": "Short for \"outfit\"; a quick display or assessment of one's attire."
    },
    {
        "term": "Flex",
        "definition": "To show off or boast about possessions, skills, or achievements."
    },
    {
        "term": "Flop",
        "definition": "The opposite of a \"bop\"; something that is unsuccessful or bad."
    },
    {
        "term": "Flop era",
        "definition": "A period of being unsuccessful or in a rut."
    },
    {
        "term": "FOMO",
        "definition": "Acronym for \"Fear Of Missing Out\"; anxiety that an exciting or interesting event may currently be happening elsewhere."
    },
    {
        "term": "Function",
        "definition": "A party or social gathering (e.g., \"pulling up to the function\")."
    },
    {
        "term": "Gagged",
        "definition": "Shocked, amazed, or left speechless (often in a positive way)."
    },
    {
        "term": "Garms",
        "definition": "Clothes, garments."
    },
    {
        "term": "Gas (someone up)",
        "definition": "To hype someone up; to encourage or compliment enthusiastically."
    },
    {
        "term": "Gassed",
        "definition": "Excited, hyped up, or overly confident. (Can also mean smelling of gas if used literally!)"
    },
    {
        "term": "Ghost",
        "definition": "To abruptly end all communication with someone, especially in dating or friendships, without explanation."
    },
    {
        "term": "Girl Dinner",
        "definition": "A collection of snacks or random foods eaten as a casual meal, often posted on social media."
    },
    {
        "term": "Girl Math",
        "definition": "A humorous justification for spending money that makes purchases seem logical or free (e.g., \"If I return this, it's free money for that\")."
    },
    {
        "term": "Glaze",
        "definition": "To excessively praise or flatter someone, often to an annoying degree or for personal gain."
    },
    {
        "term": "Glizzy",
        "definition": "A hot dog."
    },
    {
        "term": "Glow Up",
        "definition": "A significant improvement in one's appearance, confidence, or overall life."
    },
    {
        "term": "Glow-down",
        "definition": "The opposite of a \"glow up\"; a negative transformation in appearance or well-being."
    },
    {
        "term": "Gob",
        "definition": "Mouth (e.g., \"shut your gob\")."
    },
    {
        "term": "GOAT",
        "definition": "Acronym for \"Greatest Of All Time.\""
    },
    {
        "term": "Green Flag",
        "definition": "A positive, healthy, or desirable trait or behavior in a person or situation."
    },
    {
        "term": "GRWM",
        "definition": "Acronym for \"Get Ready With Me\"; a common social media video format where someone films their routine."
    },
    {
        "term": "Gruzz",
        "definition": "(Derogatory) A term for old people (less common but does exist)."
    },
    {
        "term": "Gucci",
        "definition": "Good, cool, or excellent; everything is fine."
    },
    {
        "term": "Gutted",
        "definition": "Extremely disappointed or upset. (Classic, still current.)"
    },
    {
        "term": "Gyaldem",
        "definition": "A group of female friends (often used interchangeably with \"girlies\")."
    },
    {
        "term": "Having a mare",
        "definition": "Having a difficult or frustrating time."
    },
    {
        "term": "Hella",
        "definition": "Very, extremely (more common in some UK regions, like Liverpool, influenced by US usage)."
    },
    {
        "term": "High-key",
        "definition": "Openly, obviously, or intensely; the opposite of \"low-key.\""
    },
    {
        "term": "Hits Different",
        "definition": "Something that has a unique, more profound, or better impact than usual."
    },
    {
        "term": "Hold This L",
        "definition": "\"Take this loss\"; a dismissive way to tell someone they've failed."
    },
    {
        "term": "Hot Girl Summer",
        "definition": "A period of embracing self-confidence, freedom, and enjoyment, particularly for women."
    },
    {
        "term": "Hundo P",
        "definition": "One hundred percent; absolutely sure."
    },
    {
        "term": "Huzz",
        "definition": "(Derogatory) A variation of \"hoes,\" used to objectify or belittle women (popularized by some streamers)."
    },
    {
        "term": "Ick",
        "definition": "A sudden feeling of disgust or repulsion towards someone you were previously attracted to."
    },
    {
        "term": "IJBOL",
        "definition": "Acronym for \"I just burst out laughing.\" (Online/text slang.)"
    },
    {
        "term": "IM Baby",
        "definition": "Used to express that one is acting childlike or needs to be babied."
    },
    {
        "term": "Innit",
        "definition": "Short for \"isn't it?\"; used to seek agreement or confirm something. (Very common across all ages in the UK.)"
    },
    {
        "term": "I Oop",
        "definition": "An exclamation used to express shock, embarrassment, or amusement."
    },
    {
        "term": "It's Giving",
        "definition": "Used to describe the vibe or impression something provides (e.g., \"It's giving main character energy\")."
    },
    {
        "term": "IYKYK",
        "definition": "Acronym for \"If You Know, You Know\"; refers to an inside joke or shared understanding."
    },
    {
        "term": "Karen",
        "definition": "A pejorative term for an obnoxious, angry, or entitled middle-aged white woman."
    },
    {
        "term": "L",
        "definition": "Short for \"loss\"; represents failure, something bad, or a defeat."
    },
    {
        "term": "Leg it",
        "definition": "To run away quickly."
    },
    {
        "term": "Left No Crumbs",
        "definition": "See \"Ate\"; performed so perfectly that nothing was left to be desired."
    },
    {
        "term": "Lewks",
        "definition": "A stylized way of saying \"looks,\" referring to a person's fashionable outfit or appearance."
    },
    {
        "term": "Link up",
        "definition": "To meet up with someone."
    },
    {
        "term": "Living Rent-Free",
        "definition": "When something occupies your thoughts constantly; you can't stop thinking about it."
    },
    {
        "term": "Locked In",
        "definition": "A state of total concentration on a task; completely focused."
    },
    {
        "term": "Looksmaxxing",
        "definition": "An attempt to maximize physical attractiveness, often through various (sometimes pseudoscientific) methods."
    },
    {
        "term": "Lore",
        "definition": "The backstory or context behind something, often niche or humorous, or the narrative surrounding a person/event."
    },
    {
        "term": "Low-key",
        "definition": "Secretly, subtly, or somewhat; keeping something discreet."
    },
    {
        "term": "Main Character (energy)",
        "definition": "Someone who acts like they are the protagonist of their own life story, often with a sense of self-importance or a desire to be the center of attention."
    },
    {
        "term": "Mandem",
        "definition": "A group of male friends."
    },
    {
        "term": "Menty B",
        "definition": "Short for \"mental breakdown.\""
    },
    {
        "term": "Mid",
        "definition": "Mediocre, average, or disappointing."
    },
    {
        "term": "Minging",
        "definition": "Disgusting, unattractive, or smelly."
    },
    {
        "term": "Mint",
        "definition": "Excellent, fantastic, great. (More common in the North of England, but understood broadly.)"
    },
    {
        "term": "Mog",
        "definition": "To look significantly more attractive than someone else, making them appear inferior in comparison."
    },
    {
        "term": "Mood",
        "definition": "Used to express that something is relatable or perfectly describes one's current emotional state."
    },
    {
        "term": "Moots",
        "definition": "Short for \"mutuals\"; people who follow each other on social media."
    },
    {
        "term": "Nang",
        "definition": "Excellent, awesome, very good."
    },
    {
        "term": "Nepo Baby",
        "definition": "A person whose success in a certain field (especially entertainment) is perceived to be due to their famous or well-connected parents."
    },
    {
        "term": "Noob",
        "definition": "A novice or inexperienced person, especially in gaming."
    },
    {
        "term": "NPC",
        "definition": "Acronym for \"Non-Player Character\"; someone who lacks individuality, critical thinking, or is just following the crowd."
    },
    {
        "term": "Oof",
        "definition": "An exclamation of discomfort, sympathy, or acknowledgment of a difficult situation."
    },
    {
        "term": "OK Boomer",
        "definition": "A dismissive retort to an older person perceived as being out of touch or condescending."
    },
    {
        "term": "On Fleek",
        "definition": "Perfectly executed, flawless, or on point (often used for appearance)."
    },
    {
        "term": "OOMF",
        "definition": "Acronym for \"One Of My Followers/Friends\" (on social media)."
    },
    {
        "term": "Opp",
        "definition": "Short for \"opponent\"; refers to a rival or enemy."
    },
    {
        "term": "Peak",
        "definition": "Can mean unfortunate, annoying, or bad (\"That's peak, innit?\"). Also can mean the best/ultimate point of something."
    },
    {
        "term": "Peng",
        "definition": "Attractive, appealing, or delicious. (Can be used for people, food, or things.)"
    },
    {
        "term": "Peng ting",
        "definition": "An attractive person (often female)."
    },
    {
        "term": "Periodt",
        "definition": "An emphatic way of ending a statement, adding emphasis and finality."
    },
    {
        "term": "Pick-Me (Girl/Boy)",
        "definition": "Someone who craves attention and approval, often by putting others down or trying to differentiate themselves from their peers."
    },
    {
        "term": "Piff",
        "definition": "Good, cool, high quality (often for drugs, but can be generally applied)."
    },
    {
        "term": "Plug",
        "definition": "Someone who can provide something, often illicit or hard to get (e.g., \"he's the plug for concert tickets\")."
    },
    {
        "term": "Pookie",
        "definition": "An affectionate term for a loved one, usually romantic."
    },
    {
        "term": "POV",
        "definition": "Acronym for \"Point Of View\"; often used to set the scene for a relatable scenario."
    },
    {
        "term": "Proper",
        "definition": "Very, genuinely, or intensely. (e.g., \"That was proper good.\")"
    },
    {
        "term": "Quiet Quitting",
        "definition": "Doing the bare minimum at work; fulfilling job responsibilities but not going above and beyond."
    },
    {
        "term": "Ratio (on Twitter/X)",
        "definition": "When a reply to a post gets significantly more likes than the original post, indicating widespread disapproval of the original."
    },
    {
        "term": "Receipts",
        "definition": "Proof or evidence, often in the form of screenshots or documented interactions."
    },
    {
        "term": "Red Flag",
        "definition": "A warning sign or characteristic that indicates a problematic or undesirable situation or person."
    },
    {
        "term": "Reply Guy",
        "definition": "Someone who frequently replies to tweets, often with unsolicited or unhelpful comments."
    },
    {
        "term": "Rizz",
        "definition": "Short for \"charisma\"; the ability to charm, flirt with, or attract someone. (Oxford's word of the year 2023)."
    },
    {
        "term": "Roadman",
        "definition": "A young person, typically male, associated with urban street culture. (The term itself has a specific UK connotation.)"
    },
    {
        "term": "Safe",
        "definition": "Good, alright, cool, or okay. (Very versatile, often used as a greeting or agreement.)"
    },
    {
        "term": "Salty",
        "definition": "Feeling bitter, annoyed, or jealous."
    },
    {
        "term": "Savage",
        "definition": "Bold, fearless, exceptionally cool, or delivering a harsh but clever comeback."
    },
    {
        "term": "Sending Me",
        "definition": "Making me laugh extremely hard."
    },
    {
        "term": "Shattered",
        "definition": "Extremely tired or exhausted."
    },
    {
        "term": "Sheesh",
        "definition": "An exclamation of surprise, amazement, or excitement."
    },
    {
        "term": "Ship",
        "definition": "To support a romantic relationship between two fictional characters or real people."
    },
    {
        "term": "Shook",
        "definition": "Deeply shocked, surprised, or amazed."
    },
    {
        "term": "Side Eye",
        "definition": "A look of disapproval, skepticism, or judgment."
    },
    {
        "term": "Sigma (Male)",
        "definition": "Someone who is independent, self-reliant, and often rejects social norms; a lone wolf."
    },
    {
        "term": "Simp",
        "definition": "Someone who shows excessive attention, adoration, or submissiveness towards someone they like, often in an unreciprocated way."
    },
    {
        "term": "Skeng",
        "definition": "A knife or weapon (more specific to urban slang)."
    },
    {
        "term": "Skibidi",
        "definition": "A nonsensical term popularized by a viral YouTube series, often used humorously to describe something chaotic or absurd."
    },
    {
        "term": "Slay",
        "definition": "To perform exceptionally well, succeed, or look incredibly good."
    },
    {
        "term": "Sleep On (Don't sleep on)",
        "definition": "To be ignorant of or underestimate something or someone's value."
    },
    {
        "term": "Slating",
        "definition": "To heavily criticize or badmouth someone or something."
    },
    {
        "term": "Snatched",
        "definition": "Looking incredibly stylish, attractive, or put-together."
    },
    {
        "term": "Snack",
        "definition": "A person who is very attractive."
    },
    {
        "term": "Spill the Tea",
        "definition": "Share the gossip or juicy information."
    },
    {
        "term": "Squad",
        "definition": "A group of close friends."
    },
    {
        "term": "Stan",
        "definition": "An obsessive and highly dedicated fan of a celebrity, musician, or public figure (derived from \"stalker\" + \"fan\")."
    },
    {
        "term": "Sus",
        "definition": "Short for \"suspicious\"; something or someone untrustworthy or questionable."
    },
    {
        "term": "Swings and Roundabouts",
        "definition": "Used to say that good and bad things balance each other out over time."
    },
    {
        "term": "Tea",
        "definition": "Gossip, juicy information, or secrets."
    },
    {
        "term": "TFW",
        "definition": "Acronym for \"That Feeling When...\" (used to describe relatable situations)."
    },
    {
        "term": "Thirsty",
        "definition": "Desperate for attention, approval, or sex (often online)."
    },
    {
        "term": "Thirst Trap",
        "definition": "A photo or video posted to gain attention or compliments, often implying sexual desire."
    },
    {
        "term": "Throwing a wobbly",
        "definition": "To have a tantrum or a fit of bad temper."
    },
    {
        "term": "Touch Grass",
        "definition": "A reminder to go outside and disconnect from the internet or screens."
    },
    {
        "term": "Trap Phone",
        "definition": "A burner phone; an older-style, cheap phone often used for illicit activities or by those wanting to remain discreet."
    },
    {
        "term": "Triggered",
        "definition": "Emotionally provoked or upset by something."
    },
    {
        "term": "Truss",
        "definition": "To trust or believe in someone."
    },
    {
        "term": "Turnt",
        "definition": "Excited or partying hard (often used in the context of being under the influence of alcohol/drugs)."
    },
    {
        "term": "Unhinged",
        "definition": "Wild, unpredictable, or completely over-the-top behavior."
    },
    {
        "term": "Unserious",
        "definition": "Not to be taken seriously; joking or lighthearted."
    },
    {
        "term": "Vanilla",
        "definition": "Mundane, dull, or lacking excitement."
    },
    {
        "term": "Vanish Mode",
        "definition": "A setting in some messaging apps where messages disappear after being viewed."
    },
    {
        "term": "Vibe Check",
        "definition": "An assessment of someone's mood or the general atmosphere."
    },
    {
        "term": "Vibing",
        "definition": "Being in sync with or enjoying the same energy as someone or something."
    },
    {
        "term": "W",
        "definition": "Short for \"win\"; represents success, victory, or something positive."
    },
    {
        "term": "Wagwan",
        "definition": "Short for \"What's going on?\"; a greeting. (Often associated with Caribbean influence in UK cities.)"
    },
    {
        "term": "Wet",
        "definition": "Uncool, boring, or lacking excitement."
    },
    {
        "term": "Woke",
        "definition": "Being aware of and sensitive to social and political issues, especially racial justice."
    },
    {
        "term": "Yap",
        "definition": "To talk excessively or annoyingly."
    },
    {
        "term": "Yas (Queen)",
        "definition": "An enthusiastic affirmation, often used to express excitement or approval."
    },
    {
        "term": "Yassified",
        "definition": "To be glamorized, overdone, or made fabulous in an over-the-top way (from drag culture, now widespread)."
    },
    {
        "term": "Yeet",
        "definition": "A versatile term that can be an exclamation of excitement, a sound made while throwing something forcefully, or a random filler word."
    },
    {
        "term": "Yikes/Big Yikes",
        "definition": "An exclamation of discomfort, surprise, or embarrassment."
    },
    {
        "term": "Yute",
        "definition": "A young person or youth."
    }
]
